# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [24]:
# 1. The first a random number from 1 to 4 
a = np.arange(1,5)
af = np.random.choice(a,100)

In [25]:
# 2. The second a random number from 1 to 3
b = np.arange(1,4)
bf = np.random.choice(b, 100)

In [26]:
# 3. The third a random number from 10,000 to 30,000
c = np.arange(10000,30001)
cf = np.random.choice(c, 100)

In [33]:
type(af)

numpy.ndarray

In [ ]:
# another way
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [35]:
newdf = pd.concat([pd.Series(af),pd.Series(bf),pd.Series(cf)],axis = 1 )

In [37]:
newdf.head()

   0  1      2
0  4  3  17705
1  2  3  28875
2  3  3  11287
3  3  2  11559
4  4  1  16060

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [41]:
newdf.rename(columns = {0:'bedrs', 1:'bathrs', 2: 'price_sqr_meter'}, inplace = True)

In [42]:
newdf.head()

    bedrs  bathrs  price_sqr_meter
0       4       3            17705
1       2       3            28875
2       3       3            11287
3       3       2            11559
4       4       1            16060
..    ...     ...              ...
95      4       2            25604
96      3       3            28253
97      2       2            10588
98      4       2            26898
99      1       1            16965

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [48]:
df_long = pd.concat([pd.Series(af),pd.Series(bf),pd.Series(cf)],axis = 0 )
df_long = pd.DataFrame(df_long)
type(df_long)

pandas.core.frame.DataFrame

In [50]:
df_long.rename(columns = {0:'bigcolumn'}, inplace = True)
df_long.head()

   bigcolumn
0          4
1          2
2          3
3          3
4          4

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [52]:
df_long.tail()

    bigcolumn
95      25604
96      28253
97      10588
98      26898
99      16965

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [55]:
df_long.reset_index(inplace = True)

In [56]:
df_long.tail()

     index  bigcolumn
295     95      25604
296     96      28253
297     97      10588
298     98      26898
299     99      16965